LoadTesting/API_Ping_100-Staging.txt
Run #1:

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 847.253ms, rate sampling interval: 3053ms
  Thread calibration: mean lat.: 1466.847ms, rate sampling interval: 4268ms
  Thread calibration: mean lat.: 137.299ms, rate sampling interval: 529ms
  Thread calibration: mean lat.: 127.592ms, rate sampling interval: 447ms
  Thread calibration: mean lat.: 127.279ms, rate sampling interval: 448ms
  Thread calibration: mean lat.: 1265.102ms, rate sampling interval: 3729ms
  Thread calibration: mean lat.: 1140.463ms, rate sampling interval: 3727ms
  Thread calibration: mean lat.: 1321.005ms, rate sampling interval: 3844ms
  Thread calibration: mean lat.: 1269.947ms, rate sampling interval: 3872ms
  Thread calibration: mean lat.: 1247.860ms, rate sampling interval: 3844ms
  Thread calibration: mean lat.: 135.378ms, rate sampling interval: 505ms
  Thread calibration: mean lat.: 135.112ms, rate sampling interval: 544ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   276.07ms  532.05ms   2.69s    90.74%
    Req/Sec     7.54      1.23    11.00     94.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   99.20ms
 75.000%  112.51ms
 90.000%  591.87ms
 99.000%    2.42s
 99.900%    2.62s
 99.990%    2.66s
 99.999%    2.69s
100.000%    2.69s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      82.879     0.000000            1         1.00
      91.519     0.100000         1093         1.11
      93.759     0.200000         2172         1.25
      95.551     0.300000         3248         1.43
      97.343     0.400000         4349         1.67
      99.199     0.500000         5401         2.00
     100.415     0.550000         5949         2.22
     101.823     0.600000         6483         2.50
     103.999     0.650000         7023         2.86
     106.687     0.700000         7565         3.33
     112.511     0.750000         8091         4.00
     116.543     0.775000         8364         4.44
     121.343     0.800000         8632         5.00
     127.551     0.825000         8903         5.71
     142.079     0.850000         9170         6.67
     187.007     0.875000         9440         8.00
     294.911     0.887500         9575         8.89
     599.039     0.900000         9710        10.00
    1026.559     0.912500         9845        11.43
    1440.767     0.925000         9980        13.33
    1653.759     0.937500        10114        16.00
    1805.311     0.943750        10184        17.78
    1919.999     0.950000        10251        20.00
    1968.127     0.956250        10317        22.86
    2024.447     0.962500        10384        26.67
    2115.583     0.968750        10451        32.00
    2174.975     0.971875        10489        35.56
    2217.983     0.975000        10519        40.00
    2244.607     0.978125        10553        45.71
    2287.615     0.981250        10586        53.33
    2349.055     0.984375        10621        64.00
    2365.439     0.985938        10638        71.11
    2377.727     0.987500        10657        80.00
    2396.159     0.989062        10673        91.43
    2422.783     0.990625        10689       106.67
    2467.839     0.992188        10706       128.00
    2478.079     0.992969        10714       142.22
    2486.271     0.993750        10721       160.00
    2498.559     0.994531        10734       182.86
    2504.703     0.995313        10741       213.33
    2516.991     0.996094        10749       256.00
    2527.231     0.996484        10753       284.44
    2533.375     0.996875        10755       320.00
    2539.519     0.997266        10759       365.71
    2545.663     0.997656        10763       426.67
    2586.623     0.998047        10769       512.00
    2603.007     0.998242        10770       568.89
    2605.055     0.998437        10772       640.00
    2615.295     0.998633        10776       731.43
    2615.295     0.998828        10776       853.33
    2617.343     0.999023        10781      1024.00
    2617.343     0.999121        10781      1137.78
    2617.343     0.999219        10781      1280.00
    2617.343     0.999316        10781      1462.86
    2633.727     0.999414        10783      1706.67
    2633.727     0.999512        10783      2048.00
    2635.775     0.999561        10784      2275.56
    2635.775     0.999609        10784      2560.00
    2660.351     0.999658        10785      2925.71
    2660.351     0.999707        10785      3413.33
    2662.399     0.999756        10787      4096.00
    2662.399     0.999780        10787      4551.11
    2662.399     0.999805        10787      5120.00
    2662.399     0.999829        10787      5851.43
    2662.399     0.999854        10787      6826.67
    2662.399     0.999878        10787      8192.00
    2662.399     0.999890        10787      9102.22
    2662.399     0.999902        10787     10240.00
    2693.119     0.999915        10788     11702.86
    2693.119     1.000000        10788          inf
#[Mean    =      276.068, StdDeviation   =      532.054]
#[Max     =     2691.072, Total count    =        10788]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11777 requests in 2.00m, 4.19MB read
  Non-2xx or 3xx responses: 11777
Requests/sec:     98.07
Transfer/sec:     35.72KB

Run #2

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 1165.701ms, rate sampling interval: 2985ms
  Thread calibration: mean lat.: 1090.695ms, rate sampling interval: 2707ms
  Thread calibration: mean lat.: 1163.638ms, rate sampling interval: 2985ms
  Thread calibration: mean lat.: 1655.135ms, rate sampling interval: 3944ms
  Thread calibration: mean lat.: 1092.316ms, rate sampling interval: 2695ms
  Thread calibration: mean lat.: 1086.549ms, rate sampling interval: 2695ms
  Thread calibration: mean lat.: 1037.006ms, rate sampling interval: 2695ms
  Thread calibration: mean lat.: 1093.489ms, rate sampling interval: 2695ms
  Thread calibration: mean lat.: 1091.292ms, rate sampling interval: 2742ms
  Thread calibration: mean lat.: 1157.307ms, rate sampling interval: 2936ms
  Thread calibration: mean lat.: 1093.404ms, rate sampling interval: 2742ms
  Thread calibration: mean lat.: 1728.077ms, rate sampling interval: 4134ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.26s     2.34s    9.91s    59.66%
    Req/Sec     7.83      1.54    10.00     94.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.71s
 75.000%    6.22s
 90.000%    7.82s
 99.000%    9.08s
 99.900%    9.82s
 99.990%    9.89s
 99.999%    9.92s
100.000%    9.92s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      86.207     0.000000            1         1.00
    1576.959     0.100000         1091         1.11
    2018.303     0.200000         2176         1.25
    2611.199     0.300000         3266         1.43
    3221.503     0.400000         4352         1.67
    3710.975     0.500000         5441         2.00
    4083.711     0.550000         5982         2.22
    4374.527     0.600000         6525         2.50
    4825.087     0.650000         7069         2.86
    5480.447     0.700000         7614         3.33
    6221.823     0.750000         8157         4.00
    6553.599     0.775000         8432         4.44
    6852.607     0.800000         8703         5.00
    7110.655     0.825000         8974         5.71
    7380.991     0.850000         9245         6.67
    7606.271     0.875000         9517         8.00
    7725.055     0.887500         9655         8.89
    7819.263     0.900000         9790        10.00
    7950.335     0.912500         9929        11.43
    8085.503     0.925000        10063        13.33
    8265.727     0.937500        10196        16.00
    8396.799     0.943750        10268        17.78
    8503.295     0.950000        10334        20.00
    8617.983     0.956250        10400        22.86
    8699.903     0.962500        10475        26.67
    8765.439     0.968750        10538        32.00
    8798.207     0.971875        10571        35.56
    8830.975     0.975000        10606        40.00
    8863.743     0.978125        10639        45.71
    8896.511     0.981250        10674        53.33
    8953.855     0.984375        10707        64.00
    8986.623     0.985938        10723        71.11
    9027.583     0.987500        10740        80.00
    9060.351     0.989062        10758        91.43
    9109.503     0.990625        10775       106.67
    9224.191     0.992188        10791       128.00
    9289.727     0.992969        10799       142.22
    9412.607     0.993750        10809       160.00
    9445.375     0.994531        10816       182.86
    9502.719     0.995313        10825       213.33
    9535.487     0.996094        10835       256.00
    9592.831     0.996484        10838       284.44
    9666.559     0.996875        10842       320.00
    9699.327     0.997266        10846       365.71
    9740.287     0.997656        10851       426.67
    9764.863     0.998047        10854       512.00
    9781.247     0.998242        10857       568.89
    9797.631     0.998437        10860       640.00
    9805.823     0.998633        10862       731.43
    9814.015     0.998828        10863       853.33
    9830.399     0.999023        10866      1024.00
    9830.399     0.999121        10866      1137.78
    9846.783     0.999219        10867      1280.00
    9854.975     0.999316        10869      1462.86
    9854.975     0.999414        10869      1706.67
    9863.167     0.999512        10871      2048.00
    9863.167     0.999561        10871      2275.56
    9863.167     0.999609        10871      2560.00
    9871.359     0.999658        10872      2925.71
    9871.359     0.999707        10872      3413.33
    9887.743     0.999756        10874      4096.00
    9887.743     0.999780        10874      4551.11
    9887.743     0.999805        10874      5120.00
    9887.743     0.999829        10874      5851.43
    9887.743     0.999854        10874      6826.67
    9887.743     0.999878        10874      8192.00
    9887.743     0.999890        10874      9102.22
    9887.743     0.999902        10874     10240.00
    9920.511     0.999915        10875     11702.86
    9920.511     1.000000        10875          inf
#[Mean    =     4263.244, StdDeviation   =     2337.304]
#[Max     =     9912.320, Total count    =        10875]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11730 requests in 2.00m, 4.17MB read
  Non-2xx or 3xx responses: 11730
Requests/sec:     97.65
Transfer/sec:     35.57KB

Run #3

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 134.316ms, rate sampling interval: 522ms
  Thread calibration: mean lat.: 127.984ms, rate sampling interval: 398ms
  Thread calibration: mean lat.: 131.766ms, rate sampling interval: 479ms
  Thread calibration: mean lat.: 134.495ms, rate sampling interval: 477ms
  Thread calibration: mean lat.: 128.554ms, rate sampling interval: 439ms
  Thread calibration: mean lat.: 125.108ms, rate sampling interval: 400ms
  Thread calibration: mean lat.: 134.028ms, rate sampling interval: 436ms
  Thread calibration: mean lat.: 133.634ms, rate sampling interval: 438ms
  Thread calibration: mean lat.: 128.833ms, rate sampling interval: 438ms
  Thread calibration: mean lat.: 130.533ms, rate sampling interval: 475ms
  Thread calibration: mean lat.: 131.155ms, rate sampling interval: 475ms
  Thread calibration: mean lat.: 127.750ms, rate sampling interval: 436ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   200.81ms  298.48ms   1.92s    91.83%
    Req/Sec     7.95      1.65    12.00     92.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   99.78ms
 75.000%  113.86ms
 90.000%  410.37ms
 99.000%    1.59s
 99.900%    1.80s
 99.990%    1.92s
 99.999%    1.92s
100.000%    1.92s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      85.311     0.000000            1         1.00
      92.223     0.100000         1101         1.11
      94.591     0.200000         2213         1.25
      96.575     0.300000         3340         1.43
      98.239     0.400000         4430         1.67
      99.775     0.500000         5542         2.00
     100.671     0.550000         6077         2.22
     101.823     0.600000         6621         2.50
     103.679     0.650000         7165         2.86
     107.199     0.700000         7706         3.33
     113.855     0.750000         8256         4.00
     119.615     0.775000         8530         4.44
     129.343     0.800000         8804         5.00
     149.247     0.825000         9079         5.71
     199.935     0.850000         9354         6.67
     297.215     0.875000         9630         8.00
     352.511     0.887500         9767         8.89
     410.367     0.900000         9904        10.00
     467.199     0.912500        10042        11.43
     544.767     0.925000        10179        13.33
     741.887     0.937500        10317        16.00
     847.359     0.943750        10386        17.78
     967.679     0.950000        10454        20.00
    1087.487     0.956250        10523        22.86
    1176.575     0.962500        10593        26.67
    1264.639     0.968750        10662        32.00
    1306.623     0.971875        10695        35.56
    1353.727     0.975000        10729        40.00
    1405.951     0.978125        10765        45.71
    1455.103     0.981250        10798        53.33
    1500.159     0.984375        10834        64.00
    1527.807     0.985938        10852        71.11
    1546.239     0.987500        10868        80.00
    1573.887     0.989062        10884        91.43
    1592.319     0.990625        10901       106.67
    1625.087     0.992188        10919       128.00
    1645.567     0.992969        10929       142.22
    1655.807     0.993750        10937       160.00
    1676.287     0.994531        10944       182.86
    1684.479     0.995313        10953       213.33
    1709.055     0.996094        10963       256.00
    1716.223     0.996484        10966       284.44
    1732.607     0.996875        10970       320.00
    1740.799     0.997266        10974       365.71
    1764.351     0.997656        10979       426.67
    1775.615     0.998047        10983       512.00
    1795.071     0.998242        10985       568.89
    1799.167     0.998437        10987       640.00
    1801.215     0.998633        10990       731.43
    1803.263     0.998828        10993       853.33
    1804.287     0.999023        10995      1024.00
    1804.287     0.999121        10995      1137.78
    1806.335     0.999219        10996      1280.00
    1827.839     0.999316        10997      1462.86
    1835.007     0.999414        10998      1706.67
    1852.415     0.999512        10999      2048.00
    1858.559     0.999561        11000      2275.56
    1858.559     0.999609        11000      2560.00
    1884.159     0.999658        11001      2925.71
    1884.159     0.999707        11001      3413.33
    1914.879     0.999756        11002      4096.00
    1914.879     0.999780        11002      4551.11
    1914.879     0.999805        11002      5120.00
    1919.999     0.999829        11003      5851.43
    1919.999     0.999854        11003      6826.67
    1919.999     0.999878        11003      8192.00
    1919.999     0.999890        11003      9102.22
    1919.999     0.999902        11003     10240.00
    1923.071     0.999915        11004     11702.86
    1923.071     1.000000        11004          inf
#[Mean    =      200.810, StdDeviation   =      298.483]
#[Max     =     1922.048, Total count    =        11004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12012 requests in 2.00m, 4.27MB read
  Non-2xx or 3xx responses: 12012
Requests/sec:    100.02
Transfer/sec:     36.43KB